var genders = [0, 1];
var names = [
  ['Рина', 'Вадима', 'Алиса', 'Анна', 'Петра', 'Петя', 'Дима', 'Дмитрия', 'Романа', 'Мифа', 'Мифрилла', 'Иванна', 'Атлас', 'Илья', 'Кирилла'],
  ['Рин',  'Вадим',  'Алис',  'Анн',  'Петр',  'Петя', 'Дима', 'Дмитрий', 'Роман',  'Миф',  'Мифрил',   'Иван',   'Атлас', 'Илья', 'Кирилл']
];
var surnames = [
  ['Лагутина', 'Субботина', 'Полански', 'Девятова', 'Филинцева', 'Платайс', 'Панк', 'Анучина', 'Черненко', 'Сидорова', 'Римто', 'Арджанова', 'Лост', 'Цветкова', 'Данилова'],
  ['Лагутин',  'Субботин',  'Полански', 'Девятов',  'Филинцев',  'Платайс', 'Панк', 'Анучин',  'Черненко', 'Сидоров',  'Римто', 'Арджанов',  'Лост', 'Цветков',  'Данилов']
];
var descriptions = [
  ['админ', 'искатель', 'пешка', 'линуксоид', 'шахматист', 'ало ну чо там с деньгами', 'симулякр', 'зевнула мат', 'написала книгу', 'диктатор', 'Изобарная', 'опал'],
  ['админ', 'искатель', 'пешка', 'линуксоид', 'шахматист', 'ало ну чо там с деньгами', 'симулякр', 'зевнул мат',  'написал книгу',  'диктатор', 'Изобарный', 'опал']
];

function random(arr) {
  return arr[Math.floor(Math.random() * arr.length)];
}

document.addEventListener('DOMContentLoaded', function() {
  var content = document.getElementById('content');
  document.getElementById('btn').addEventListener('click', function() {
    this.innerText = 'Попробовать снова';
    var gender = random(genders);
    content.innerText = random(names[gender]) + ' ' + random(surnames[gender]) + ' — ' + random(descriptions[gender]);
  })
})
